flute_RAS_case1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.015 -0.015 -0.0225)
    (0.015 -0.015 -0.0225)
    (0.015 0.015 -0.0225)
    (-0.015 0.015 -0.0225)
    (-0.015 -0.015 0.6775)
    (0.015 -0.015 0.6775)
    (0.015 0.015 0.6775)
    (-0.015 0.015 0.6775)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (6 6 140) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
