flute_RAS_case1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Ux    -5;
Uy    -5;
Uz    0;

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    body
    {
        type            noSlip;
    }
    closed
    {
        type            noSlip;
    }
    opened
    {
        type            zeroGradient;
    }
    hole0_inlet
    {
        type            fixedValue;
        value           uniform ($Ux $Uy $Uz);
    }
    hole0_outlet
    {
        type            zeroGradient;
    }
    hole1
    {
        type            zeroGradient;
    }
    hole2
    {
        type            zeroGradient;
    }
    hole3
    {
        type            zeroGradient;
    }
    hole4
    {
        type            zeroGradient;
    }
    hole5
    {
        type            zeroGradient;
    }
    hole6
    {
        type            zeroGradient;
    }
    hole7
    {
        type            zeroGradient;

    }
}

// ************************************************************************* //
