flute_RAS_case1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

val    0.1875;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $val;

boundaryField
{
    body
    {
        type            kqRWallFunction;
        value           uniform $val;
    }
    closed
    {
        type            kqRWallFunction;
        value           uniform $val;
    }
    opened
    {
        type            zeroGradient;
    }
    hole0_inlet
    {
        type            fixedValue;
        value           uniform $val;
    }
    hole0_outlet
    {
        type            zeroGradient;
    }
    hole1
    {
        type            zeroGradient;
    }
    hole2
    {
        type            zeroGradient;
    }
    hole3
    {
        type            zeroGradient;
    }
    hole4
    {
        type            zeroGradient;
    }
    hole5
    {
        type            zeroGradient;
    }
    hole6
    {
        type            zeroGradient;
    }
    hole7
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
